In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [7]:
df.head

<bound method NDFrame.head of                    A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055>

In [8]:
df.head(2)

                   A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [10]:
df.sample

<bound method NDFrame.sample of                    A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055>

In [11]:
df.sample(2)

                   A         B         C         D
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-02  1.255651 -0.747050  0.944090 -0.563807

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[-1.61769477,  0.11390857,  1.2748284 ,  1.87608693],
       [ 1.2556511 , -0.74705018,  0.94408966, -0.56380716],
       [-1.17584472, -0.13401857, -0.91298398,  1.25439557],
       [-0.75154033, -0.50809197,  1.76478251,  0.15106602],
       [-1.33546077, -0.24875799,  1.54737945,  1.0458488 ],
       [ 0.49155374, -0.60749446,  0.79546656,  0.74405496]])

In [15]:
df.describe()    # mean:산술평균값, median:중간값

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.522223 -0.355251  0.902260  0.751274
std    1.142786  0.322766  0.959916  0.859634
min   -1.617695 -0.747050 -0.912984 -0.563807
25%   -1.295557 -0.582644  0.832622  0.299313
50%   -0.963693 -0.378425  1.109459  0.894952
75%    0.180780 -0.162703  1.479242  1.202259
max    1.255651  0.113909  1.764783  1.876087

In [16]:
df

                   A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.617695    1.255651   -1.175845   -0.751540   -1.335461    0.491554
B    0.113909   -0.747050   -0.134019   -0.508092   -0.248758   -0.607494
C    1.274828    0.944090   -0.912984    1.764783    1.547379    0.795467
D    1.876087   -0.563807    1.254396    0.151066    1.045849    0.744055

In [18]:
df.sort_index?

Signature:
df.sort_index(
    axis=0,
    level=None,
    ascending=True,
    inplace=False,
    kind='quicksort',
    na_position='last',
    sort_remaining=True,
    by=None,
)
Docstring:
Sort object by labels (along an axis)

Parameters
----------
axis : index, columns to direct sorting
level : int or level name or list of ints or list of level names
    if not None, sort on values in specified index level(s)
ascending : boolean, default True
    Sort ascending vs. descending
inplace : bool, default False
    if True, perform operation in-place
kind : {'quicksort', 'mergesort', 'heapsort'}, default 'quicksort'
     Choice of sorting algorithm. See also ndarray.np.sort for more
     information.  `mergesort` is the only stable algorithm. For
     DataFrames, this option is only applied when sorting on a single
     column or label.
na_position : {'first', 'last'}, default 'last'
     `first` puts NaNs at the beginning, `last` puts NaNs at the end.
     Not implemented for MultiIndex.
sort_remaining : bool, default True
    if true and sorting by level and index is multilevel, sort by other
    levels too (in order) after sorting by specified level

Returns
-------
sorted_obj : DataFrame
File:      c:\programdata\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [19]:
df.sort_index(axis=0, ascending=False)    # axis=0으로 두면 행이 바뀜 (a,b)에서 a행 b열, a=인덱스0, b=인덱스1

                   A         B         C         D
2013-01-06  0.491554 -0.607494  0.795467  0.744055
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-01 -1.617695  0.113909  1.274828  1.876087

In [20]:
df.sort_index(axis=1, ascending=False)     # ascending=False : 내림차순

                   D         C         B         A
2013-01-01  1.876087  1.274828  0.113909 -1.617695
2013-01-02 -0.563807  0.944090 -0.747050  1.255651
2013-01-03  1.254396 -0.912984 -0.134019 -1.175845
2013-01-04  0.151066  1.764783 -0.508092 -0.751540
2013-01-05  1.045849  1.547379 -0.248758 -1.335461
2013-01-06  0.744055  0.795467 -0.607494  0.491554

In [22]:
df.sort_values(by='2013-01-05', axis=1, ascending=True)    # ascending=True : 오름차순

                   C         D         B         A
2013-01-01  1.274828  1.876087  0.113909 -1.617695
2013-01-02  0.944090 -0.563807 -0.747050  1.255651
2013-01-03 -0.912984  1.254396 -0.134019 -1.175845
2013-01-04  1.764783  0.151066 -0.508092 -0.751540
2013-01-05  1.547379  1.045849 -0.248758 -1.335461
2013-01-06  0.795467  0.744055 -0.607494  0.491554

In [23]:
df['A']

2013-01-01   -1.617695
2013-01-02    1.255651
2013-01-03   -1.175845
2013-01-04   -0.751540
2013-01-05   -1.335461
2013-01-06    0.491554
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]      # 인덱스0부터 인덱스2까지

                   A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396

In [25]:
df['2013-01-02':'2013-01-04']     # 인덱스처럼 들어오지 않고 지정한 값이 들어옴

                   A         B         C         D
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066

In [26]:
df[df['A']>1]      # df['A']의 값이 1보다 큰 것만 가져오도록 조건 지정

                   A        B        C         D
2013-01-02  1.255651 -0.74705  0.94409 -0.563807

In [27]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.loc[dates[0]]
# df.loc['2013-01-01'] : 라벨값을 넣어도 됨

A   -1.617695
B    0.113909
C    1.274828
D    1.876087
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
# df.loc['A']  -> 에러 발생 / 열은 안됨
# df.loc[['A', 'B']]   -> 에러
df.loc[:, 'A']    # 행을 써주고 열을 써주어야 호출 가능 # df.loc[:, ['A', 'B']]  여러개일때 묶어주기

2013-01-01   -1.617695
2013-01-02    1.255651
2013-01-03   -1.175845
2013-01-04   -0.751540
2013-01-05   -1.335461
2013-01-06    0.491554
Freq: D, Name: A, dtype: float64

In [32]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.751540 -0.508092
2013-01-05 -1.335461 -0.248758

In [33]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [34]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -1.617695  0.113909  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [35]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -1.617695  0.113909  1.274828  1.876087    one
2013-01-02  1.255651 -0.747050  0.944090 -0.563807    one
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396    two
2013-01-04 -0.751540 -0.508092  1.764783  0.151066  three
2013-01-05 -1.335461 -0.248758  1.547379  1.045849   four
2013-01-06  0.491554 -0.607494  0.795467  0.744055  three

In [36]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396   two
2013-01-05 -1.335461 -0.248758  1.547379  1.045849  four

In [38]:
df.at[dates[0], 'A']

-1.6176947655275027

In [40]:
df.iat[0, 1]   # iat : 인덱스값으로 접근 가능

0.0

In [46]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -1.617695  0.000000  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [47]:
df2[df2 > 0] = -df2
df2

                   A         B         C         D
2013-01-01 -1.617695  0.000000 -1.274828 -1.876087
2013-01-02 -1.255651 -0.747050 -0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984 -1.254396
2013-01-04 -0.751540 -0.508092 -1.764783 -0.151066
2013-01-05 -1.335461 -0.248758 -1.547379 -1.045849
2013-01-06 -0.491554 -0.607494 -0.795467 -0.744055

In [52]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C         D   E
2013-01-01 -1.617695  0.000000  1.274828  1.876087 NaN
2013-01-02  1.255651 -0.747050  0.944090 -0.563807 NaN
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396 NaN
2013-01-04 -0.751540 -0.508092  1.764783  0.151066 NaN

In [53]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2013-01-01 -1.617695  0.000000  1.274828  1.876087  1.0
2013-01-02  1.255651 -0.747050  0.944090 -0.563807  1.0
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396  NaN
2013-01-04 -0.751540 -0.508092  1.764783  0.151066  NaN

In [59]:
df1.dropna?

Signature: df1.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. deprecated:: 0.23.0

       Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame
    DataFrame with NA entries dropped from it.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'born'])
       name        toy       born
1    Batman  Batmobile 1940-04-25

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      c:\programdata\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [50]:
df1.dropna(how='any')    # dropna : Na값을 없앰  <-> fillna

                   A        B         C         D    E
2013-01-01 -1.617695  0.00000  1.274828  1.876087  1.0
2013-01-02  1.255651 -0.74705  0.944090 -0.563807  1.0

In [54]:
df1.dropna(how='any', axis=1)

                   A         B         C         D
2013-01-01 -1.617695  0.000000  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066

In [55]:
df1

                   A         B         C         D    E
2013-01-01 -1.617695  0.000000  1.274828  1.876087  1.0
2013-01-02  1.255651 -0.747050  0.944090 -0.563807  1.0
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396  NaN
2013-01-04 -0.751540 -0.508092  1.764783  0.151066  NaN

In [56]:
df1.fillna(value=5)    # fillna : Na값을 value값으로 채움

                   A         B         C         D    E
2013-01-01 -1.617695  0.000000  1.274828  1.876087  1.0
2013-01-02  1.255651 -0.747050  0.944090 -0.563807  1.0
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396  5.0
2013-01-04 -0.751540 -0.508092  1.764783  0.151066  5.0

In [60]:
df1.isna()    # True, False로 리턴

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [62]:
df

                   A         B         C         D
2013-01-01 -1.617695  0.000000  1.274828  1.876087
2013-01-02  1.255651 -0.747050  0.944090 -0.563807
2013-01-03 -1.175845 -0.134019 -0.912984  1.254396
2013-01-04 -0.751540 -0.508092  1.764783  0.151066
2013-01-05 -1.335461 -0.248758  1.547379  1.045849
2013-01-06  0.491554 -0.607494  0.795467  0.744055

In [61]:
df.apply(np.cumsum)   # 누적 합

                   A         B         C         D
2013-01-01 -1.617695  0.000000  1.274828  1.876087
2013-01-02 -0.362044 -0.747050  2.218918  1.312280
2013-01-03 -1.537888 -0.881069  1.305934  2.566675
2013-01-04 -2.289429 -1.389161  3.070717  2.717741
2013-01-05 -3.624889 -1.637919  4.618096  3.763590
2013-01-06 -3.133336 -2.245413  5.413563  4.507645

In [63]:
# 람다 사용하기
df.apply(lambda x: x.max() - x.min())

A    2.873346
B    0.747050
C    2.677766
D    2.439894
dtype: float64